= 聴いて学ぼう

//flushright{
@ditflame
//}

社会人になってから、学生の頃と大きく「学び」の面で変わる点に、「割ける時間」が激変するというものがあります。

この章では、「割ける時間」が激変する事への対抗策の一つとして、「聴いて学ぶ」点、またその具体的な方法や、自分自身で「聴いて学ぶ」音声をどう作るかといった点を深堀りします。

== 聴いて学ぶ際のメリット・デメリット

座学と違い、聴いて学ぶ際には次のようなメリット・デメリットがあります。

=== メリット

 * 耳が空いていればいつでも学べる

端的に書くとこの1点です。耳があいているタイミングならいつでもOK。

それは例えば移動中かもしれないし、家事をしている時や、作業中にBGM代わりに、といったケースもアリかもしれません。

=== デメリット

 * 座学に比べて学習の効率が別段いいわけではない
 * 聴いて学ぶための手段が要る

当然、机に座って集中して学ぶほうが効率は良さそうです。また、「聴いて学ぶ」特性上、それに対応した手段を用意する必要があります。

== 聴いて学ぶための手段

聴いて学ぶためには、なんらかの形で音声データになった学習教材が必要です。

具体的には次のような物が考えられます。

 * Podcastのような音声で提供されている「学び」
 * 自分で録音する
 * テキストから音声に変換する

=== 音声で提供されている「学び」

これは、さまざまな方が配信されているPodcastや、たとえば資格のスクールなんかで提供されることがある音声講義などが該当するでしょう。

すでに提供されている音声であれば、手軽に始められるのが最大の利点です。

=== 自分で録音する

自分で録音する場合は、ヘッドセットを使って録音するのがおすすめです。

//image[recoding][ChatGPT画伯に描いてもらった][scale=0.5]

なお、

 * 少しゆっくり目に話す
 * マイクと口の距離を一定にする
 * 声の音量を一定にする

と聞きやすくなります。

=== テキストから音声に変換する

テキストデータがあれば、音声に変換する事で、音声学習用の音声データを大量に作り出す事ができます。

これには、棒読みちゃん @<fn>{BouyomiChan} やSuno @<fn>{suno} を使うのが楽でしょう。なお、Sunoを使うと曲になります！

※注：他にもVOICEROIDやSofTalkなど他の読み上げソフトも無償で使えるケースがあるようです。

//footnote[BouyomiChan][https://chi.usamimi.info/Program/Application/BouyomiChan/]
//footnote[suno][https://suno.com/ ※あくまでSunoはAI作曲ソフトですが、節に乗せた方が覚えやすいケースもあり、そういう場合は有用。単なる読み上げソフトを使うか自動作曲ソフトを使うかのどっちが良いのか？　という点については、ケースバイケースです。]

具体的にこのアプローチが良く効くのは、なんらかの具体的なルール集(例:ISOの条文とか……)や、明文化されたベストプラクティスがあってそれを覚える必要がある場合で、実際に筆者が試験を受けてきた中で、良く効いたなと感じたのは情報セキュリティスペシャリスト試験@<fn>{riss}や、kintone認定カイゼンマネジメントエキスパート試験@<fn>{kintone-kme}です。

//footnote[riss][現在の情報処理安全確保支援士試験( https://www.ipa.go.jp/shiken/kubun/sc.html )の前身。試験内容はほぼ変わってない気がする]

//footnote[kintone-kme][https://cybozu.co.jp/kintone-certification/level/kaizenmanagement-expert/]

====[column] 自動変換で読み間違いが起きる件

日本語を読み上げツールや、AI作曲ツールで音にする時、そもそも内部的な処理としては漢字をよみがなにして、「どう読んでいるか」を生成して音にするのですが、漢字って様々な読み方があるので、そのまま世にあるテキストデータの文章を音楽にすると、高頻度で読み間違えた音声や曲が生成されるケースがままあります。

　

こういった読み間違いが発生する際は、そういった漢字をひらいて(ひらがなにして)、読み間違う箇所をあらかじめクリアして歌詞として食わせるか、棒読みちゃんなどの専門的な音声読み上げソフトの場合は、漢字に対するよみがなをあらかじめ辞書として指定できるので、そういった機能で誤読を回避すると、より学びやすくなります。

====[/column]

== おわりに

正確さよりも概念の理解など、大枠での基礎的な能力を求められるタイプの試験では、音声による学習はハマるとめっぽう強い実感があります。

ぜひ、自らの「学び」に取り入れてみてください！

