= 興味関心を持つために情報や人の近くにいる

== はじめに

//flushright{
うーたん（uutan1108）
//}

うーたん（@uutan1108）です。株式会社ゆめみでサーバーサイドエンジニアをしています。私は、現在新卒2年目のエンジニアで、経験も浅いですが、様々なことをしてきたつもりなので、今までの経験からの学びを書きます。

これまで、他の技術同人誌に寄稿、コンピューター雑誌に寄稿、技術カンファレンスでの登壇、技術コミュニティーの主催なども行ってきました。

これらの経験を通じて、常に情報や人の近くにいることが興味関心をかき立てる鍵ではないかと考えるようになりました。

この章では、情報や人の近くにいたことでどのように興味関心が生まれ、それが何に繋がったのかを書きます。

== 興味関心を持つことが学びのスタート地点

まず、私は「興味関心を持つことが学びのスタート地点」だと思っています。この本では「学び」についてたくさん書かれていますが、その前段階にある「情報を得る」や「興味を持つ」ために私がしてきたことについて書きます。

皆さんも、何かの情報を見聞きして興味を持ち、その情報をきっかけに学びを深めていった経験があるのではないでしょうか。

=== 情報を得るために

情報は、人から媒体を通じて伝わります。そのため、まずは媒体を探すところから始まります。例えば、X（旧Twitter）などのSNS、YouTubeなどの動画、あるいは書籍、有名な技術系ブログなどです。また、情報が集まる場として、勉強会やカンファレンスも有益です。

これらの媒体や場に積極的に触れることが「学び」のファーストステップだと考えています。

また、特定の媒体だけではなく、様々な媒体から情報を得ることで、興味の幅を広げるきっかけになることがあります。

=== 人の近くにいる

情報は人から生まれます。そのため、情報を発信している人の近くにいることで、興味関心をかき立てられることが多いです。また、媒体を介さないで直接触れることで、見えなかった情報や背景が理解できる場合もあります。

どのように近づけばいいのかわからない場合は、Xなどでフォローしている人がいそうな場所に足を運び、その人が発信している情報について感想を伝えるところから始めると良いと思います。

== 負の状態から脱却するのは新しい興味を見つけた瞬間

「あの人は凄そう。自分も何かしたいけど、何をしたいのかわからない。」
「何かしたいけど、何もしたいことがない。でも、何かしたくて情報を追ったり、人と話したりしている。」

私は、このような負の状態によく陥ります。陥ると表現しますが、悪いことだとは思っていません。このような感情を持っても数ヶ月後には消えていることが多いような気がします。

何かしたいけど何をしたいのか分からないという時期や瞬間はあると思います。その状態を抜け出す時も人や情報だと思っています。

何気なく目に飛び込んできた情報がきっかけで、やる気が湧いてきたり、他者からの何気ない言葉がきっかけで新しいことに挑戦する勇気をもらえることがあります。

== 具体的に私が人や情報で学びに繋げられた事例

今まで抽象的な話を書いてきたので、最後に私の経験について書きます。

=== 場に参加して人と話せたからコンピューター雑誌に寄稿できた

技術同人誌を書いてみたいけど書く勇気がないと思っていました。負の感情を持ち続けていた状態でした。

しかし、技術同人誌即売会に参加して、コンピューター雑誌に寄稿できることを知り、技術同人誌を執筆されている方々に相談して勇気をもらえたのがきっかけで寄稿しようと思えました。

単に「寄稿できる」という情報だけだったら、寄稿せずに諦めていたかもしれません。場に参加して人と話して興味関心を駆り立てられたのが要因で踏み出せたと思っています。

=== 場に参加して技術カンファレンスなどで登壇したいと思えた

私と同期のエンジニアが登壇していて、自分もしたいと思ったのがきっかけでした。場所に参加せずに、どのような人が話しているのかに関心を持たなければ、自分も登壇してみたいと思うことはなかったと思います。

そして、技術カンファレンスについて知ったのも情報を追っていたからであり、情報を追っていなければ開催されていることすら知らなかったと思います。

=== 場に参加して勉強会運営に誘われて、自分でもエンジニアコミュニティーの主催をした

技術カンファレンスに参加し、そこで会った方に誘っていただいたのがきっかけでした。それがきっかけで、勉強会を開く側を経験することができました。それ以前から勉強会には参加や登壇していて、雰囲気や必要そうなことは知っていたので誘っていただけたのかなと思います。

その後、自分でも勉強会を主催することにしました。主催するときも、今までに会った方やXで相互フォローしていた方々に来ていただき、嬉しかったことを覚えています。

== まとめ

情報を得ることや人とのつながりを持つことは、興味や学びを生み出す大きなきっかけになります。特に、実際に場に足を運んで人と話すことは、情報だけでは得られない具体的な刺激や、踏み出すための勇気を与えてくれます。また、他者の経験に触れることで、新しい視点を得たり、自分では気づかなかった可能性に気づくこともあります。

「何かしたいけれど具体的にわからない」という負の状態に陥ることはあると思います。この状態自体が悪いわけではありませんが、そこから抜け出すためには、自ら情報を追いかけたり、人と接点を持つことが有効です。何気ない会話やちょっとした情報が、新しい興味を見つけたり、新しい挑戦を始めるきっかけになるかもしれません。

また、情報を得る際には、一つの媒体や一つの場に偏らず、複数から得ること重要だと思います。そして、複数から得ることで興味の幅を広げるのにも役立つと思います。

そして、情報を蓄え、人とつながりを持つ習慣を作ることで、自然と新しい機会や挑戦が生まれやすくなると思います。

私自身の経験からも、情報や人との関わりが新しい学びや成長の原動力になると感じています。技術同人誌の執筆やカンファレンスでの登壇、コミュニティの主催なども、情報を得て人とつながった結果、実現できたことです。このような実体験を通じて、情報と人の近くにいることの大切さを実感しました。

これからも情報を蓄え、人と交流する習慣を続け、興味を深め、新しい挑戦をしていきたいと思っています。
