= 横断的な知識をまとめる本を作ってみた。そこでの学び

//flushright{
おやかた@oyakata2438
//}

2024年末の冬コミ合わせで、この「ワンストップ学び」を書いていますが、それと並行して個人プロジェクトとして、「ワンストップ物理解析」という本を作っています。

SEMとか、FTIRとか、XRDとか。SEMは電子顕微鏡、XRDはX線回折。物質の表面構造をナノレベルで観察したり、結晶構造（結晶構造を解析して、結晶の同定を行ったり）といった、さまざまな技術があります。それぞれの技術には、それぞれのエキスパートがいて、それらを活用してそれぞれの目的の分析を行っています。また、それぞれの教科書、論文がたくさん出ていますし、使う上でのノウハウもたくさんあるでしょう。

でも、案外、「こういう測定をしたいときに何を使えばいいのか？」といった問題に対して、サクッと答えてくれる本ってなかったように思います。そして、それは特に分野外の人にはハードルが高いもの。

だから、「やりたいこと」から始めてツールを見つけるような入門書があったら面白いのでは？と考えたのが本書のきっかけです。

例えば、1um程度の凹凸がある表面の性情を観察したいときは何を使えばいいのか、それが１ｍｍだったら？逆に1nm、1原子層だったら？そういった観点で書いてみるのも面白いかも。

そして、それぞれの技術・装置について、ごく簡単な説明（具体的な分量としては１ページ）があって、原理と得意不得意がなんとなくわかる。みたいな本です。

　

　

さて、そんな本を書き始めたのですが、ChatGPTに大変お世話になりました。

いろいろな装置名を入れて、ChatGPTに、「SEM（走査型電子顕微鏡）について、600字程度で説明をしてください。教科書を1冊つけてください」と聞くことで、概要、原理、特徴、用途などについてのかなり自然な文章を得ることができます。それを読むだけでも、特に用途や活用・注目されている分野についての学びがあります。関連技術との関係などもわかりますね。

1ページにまとめるとなると、細かい話、数式や図などは落ちますが、それでも概要を知る程度には役に立ちます。X線を打って、その反射(回折)の様子から、結晶の並びを見るんだな、くらいの概要をつかむ話です。

この本を書いての学びは、やはり、調べながら書くことで、「非常に広い分野（の表面）を知ることができた」という学びがありました。実際に使っている、かかわっている技術ばかりではないので、名前は聞いたことがあるレベルだったとして、
