= 学べる環境に身をおいてしまえば学ばざるを得ず、強制的に学べる

== はじめに

この章は要約すると、「身銭を切ると思った以上に学べる」みたいな話です。

筆者は、社会人になって最初に入った会社が上場企業だった為、従業員持株会制度がありました。

なお、従業員持株会制度については以下の説明が参考になります（ChatGPT調べ）。

//emlist{
従業員持株会制度は、企業がその従業員に対して、自社株を購入する機会を提供する制度です。この制度の主な目的は、従業員が自社の経営に関与し、その成果に直接的な関心を持つことを促すことにあります。以下はその特徴です：

従業員の関与促進: 従業員が株を持つことで、会社の業績に対する関心が高まります。これは、従業員が自社の成功に直接的な影響を受けるためです。

利益の分配: 従業員持株会を通じて、従業員は配当や株価上昇の恩恵を受けることができます。

長期的な雇用関係の促進: 従業員が自社の株を持つことで、会社への忠誠心が高まり、離職率の低下に繋がることがあります。

税制上のメリット: 一部の国では、従業員持株会を通じて株を購入することに税制上のメリットがあります。

実施方法: 通常、従業員持株会は特別な条件で株を従業員に提供することが多いです。例えば、割引価格で株を購入できる、または特定の期間勤務した従業員だけが購入資格を得るなどです。

この制度は、従業員と会社の双方にメリットをもたらす可能性がありますが、株価の変動リスクや従業員の投資ポートフォリオの多様性の欠如などのリスクも伴います。
//}

筆者が新人で入った会社が良かったのか悪かったのかについては、メリット・デメリットがそれぞれ色々とあったので、手放しで「全部良かった！」という感じでもないのですが、メリットだったと感じる中でトップレベルに大きかったのは「この制度のおかげで株や金融証券についての知識がある程度身についた」点だと思っています。

== 持株会の何がそんなに良かったのか

持株会の最大のメリット（であり、人によっては最大のデメリット）は、「株を買う事になる」点です。

特に、上場企業の株を持株会で購入する場合は、購入した株が市場で常に売買されている関係で常に株価が上下動を繰り返します。

一般的に、自分ごとになっていない事象についてはあまり真剣に意識を注ぎ続けられないものですが、自分のお金をそこに入れた瞬間、自社の株式の動きは「自分ごと」になり、ずっとそれを気にし続けるようになるケースが多いのではないかと思っており、私もご多分に漏れずそうでした。@<fn>{finance}

//footnote[finance][実はこういった経済に連動する金融商品は、細かく見ずにほったらかすのが一番賢いという話もあるのだけど……]

当然、自社の株価や日経平均、TOPIXなどの動きを日常的に追い続けると、最初はわからなかった経済や世の中の株式・債権の仕組みなどを体感として学んでいく事ができます（株価の上下にともなうテンションの上げ下げを喰らいながらですが）。

そしていつしか、金融リテラシーが身についていくわけです。

== 「これから上がる株」みたいな本一杯あるけどさぁ

そんな本は世に一杯あります。株で爆益だとか、億り人だとか……

ただ、筆者としてはこういった個別株を個人で持つ事の最大のメリットについては、そういった書籍で語られがちな「貯金よりも利率が良い」や「儲かる」といった煽りには違和感を感じていて、たぶんそうではないのだろうな　と思っています。

というのも、具体的には株式を軽くでも買ってみると、身銭を切って継続的に経済動向を監視せざるを得ない状況に体を置けます（置かないといけなくなります）。その結果、「社会人としての経済リテラシーがガンガン乗る」所が最大の妙味なんじゃないかな、そしてこれは「学び」なのだ。と感じています。

当然、「学び」が進む仮定で一般的な市場参加者が気づけなかった着眼点に気づけるかもしれませんし、気づいて株式を購入すれば、ある程度美味しいリターンを得られるかもしれません。ただしそれは「学び」の結果の産物であって、学べたからこそ成果が出て、結果として投資リターンも出ている　という捉え方が正しいんじゃないかなー　と個人的には思っています。

投資はあくまで自己責任にはなりますが、余剰資金@<fn>{yojyou}で色々試し、学んでみると、より豊かな「学び」が待っているのではないでしょうか。

//footnote[yojyou][余剰資金というのは、『失っても痛くないと思える』金額の範疇に入る資金の事です]
