= 放送大学で情報学を体系的に学ぶ

== はじめに

//flushright{
yuusukesan@yuusukesan1018
//}

はじめまして、yuusukesan1018と申します。
エンジニアとして働き始めてから、日々の業務をこなすことに精一杯だった私が、放送大学で情報学を学ぶことについて考えてみます。

== 文系エンジニアが放送大学で学び直しを決意した瞬間
エンジニアとして3年目を迎え、これまでの振り返りと今後について考えるようになり、仕事を通じて、以下のことを考えるようになりました。

「システム開発の実装自体は容易になっていく一方で、より深いレベルでの理解がなければ質の高いものは作れない」

開発作業をすること自体は、AIできます。しかし、チューニングは、別途知識が必要があると考えました。そのためには、コードを書く開発経験と共に情報学の基礎を学ぶ必要があると考えました。

== 情報学を体系的に学べる方法

情報学を体系的に学べる方法を調べていく中で、以下の3つの方法を検討しました。

 * 大学
 * 書籍
 * オンラインサービス

=== 大学
大学は、1年生からやり直すので、時間が勿体ないと考える人もいることでしょう。
編入制度を利用すると、過去の大学の単位を利用できます。
この制度を利用することで、専門の科目だけを履修して、卒業できます。

=== 書籍
書籍を利用して、情報学を学べます。
必要な分野をピックアップして、該当する書籍を書店やAmazonにて購入して、勉強できます。
また、図書館を利用することで、書籍代を抑えることができます。
学びにコストをかけたくないという人におすすめの学びの方法といえます。

=== オンラインサービス
couseraやedXといったオンラインサービスを利用して、情報学を学ぶことができます。
couseraでは、海外の有名大学のコースを提供しており、一部のコースにおいて、日本語字幕を対応している講座もあります。
必要な講座だけを履修できること、また、講座を修了すると、LinkedInのステータスに追加できます。


== 放送大学以外の選択肢

大学には、従来の対面式とオンライン型の2種類があります。
社会人の学び直しでは、近年、オンライン大学が注目されています。

日本では、通信制の放送大学や帝京大学理工学部情報科学科通信教育課程などがあります。
海外では、UoPeopleというアメリカのオンライン大学などがあります。


== 放送大学で情報学を学ぶメリット

放送大学で情報学を学ぶメリットは、以下の2つです。

 * 理論と実践の往復学習ができる
 * 低コストで体系的に学べる

それぞれについて、具体的ご紹介します。

=== 理論と実践の往復学習

学びには、実践という経験からの学びと書籍などの体系的な概念や理論から学びという2つがあります。
学生時代は、教科書を利用した知識としての学びが中心です。
一方で、社会人は、仕事を通じた経験からの学びが中心となります。

理論と実践の往復学習をすることで、理論が実践でどう活かされるのか理解できる。
経験で学んだことを理論的に裏付けられるという効果が期待できます。

理論と実践の往復学習は、理解をより深めることができると考えています。


=== 低コストで体系的に学べる
大学のキャンパスに通って、体系的に学ぶ場合、学費というコストがかかります。
放送大学では、面接授業とオンライン授業が1単位あたり6,000円(2024年12月時点)です。放送授業が、1科目2単位で、12,000円(2024年12月時点)です。
卒業研究を行う場合は、6単位が必要となります。
例えば、本科生として3年次編入し、卒業を目指す場合は、入学料、既修得単位認定審査等手数料、そして、授業料が必要です。卒業までに、約40.6万円が必要となります。

//table[cost][学費]{
項目	価格
-------------------------------------------------------------
入学料	24,000円
授業料(62単位分)	372,000円
既修得単位認定審査等手数料	10,000円
合計	406,000円
//}

== 仕事と放送大学での学びを両立するために気をつけること
仕事をしながら、放送大学で情報学を学ぶにあたり、両立ができるのかと気になる人もいるかもしれません。
大学に注力するあまり、仕事に影響が出るかもしれない、そして、仕事に追われて時間がなく、大学の授業を等閑(なおざり)にしてしまうことも考えられます。

仕事と放送大学での学びを両立するにあたり、時間管理とYoutubeの活用という2つの点を意識して、取り組む必要があると考えています。

=== 時間管理
放送大学は、1つの授業が45分となります。
ルールを決めて、習慣化するようにしています。

例えば、月曜日と火曜日のどちらかに、「数学」、水曜日と木曜日に「仕事に関係する科目」、そして、土日の午前中に、残りの科目を受講するというように決めています。

時間枠を固定して、習慣化するように意識しています。

=== Youtubeの活用
Youtubeの活用もおすすめです。
Youtubeでは、質の高い授業が行われているケースもあります。
特に、数学は、Youtubeでわかりやすい授業を発信している人もたくさんいます。

事前に授業で学ぶテーマを確認して、関連するテーマのYoutubeを探します。
Youtubeを取り入れて、以下のサイクルを意識しています。

 * 予習：動画を2倍速で視聴して大まかな概要を掴む
 * 講義：理解に注力、わからないワードをメモ
 * 復習：わからないワードをChatGPTで確認する、講義の参考文献を確認する

Youtubeは、通勤している人ならば、通勤途中に見ることもできます。
放送大学の本科生の場合、学割を利用して、月額780円にて、Youtube Premiumに加入できるので、広告をカットでき、ストレスなく視聴できます。

== 放送大学で勉強するにあたってのQ&A
放送大学で情報学を学ぼうとしている人から受けたことのある質問を最後にご紹介します。

=== 単位認定試験の準備はどうしている？

放送大学では、通信指導という名の中間試験があります。
この通信指導を受けないと、最後の試験を受けることができません。
通信指導には、評価に使われる通信問題と評価には評価されない自習型問題があります。
テスト前には、通信問題の復習と自習型問題を解くようにしています。
また、過去問も教務情報システムに掲載されているので、該当する科目の過去問を解くようにしています。
更に、教科書を読んだり、わからないところは、ChatGPTに聞いて、理解するようにしています。

=== モチベーション維持方法は？

モチベーションを維持するのは、大変な時もあります。
ただ、学問として、情報学を楽しむようにしています。
また、学位授与機構を通して、学位を取得してからのキャリアをイメージしてモチベーションを維持しています。
もちろん、テストが終わった後は、美味しいものを食べたりして、気分転換をしています。

=== 仕事にどのように活かせているか？

ネットワークの授業を受講してから、インフラ関連業務の解像度が上がりました。
これまでのデータベース関連の業務についてより理解したいので、来期データベースの授業を受講しようと考えています。

== さいごに
この原稿の執筆にあたり、私は放送大学での学びに関する過去のメモを見直しました。
インターネット上において、多くの方が経験を発信している中で、自分の体験が他者の役に立つのか迷いがありました。
一方で、執筆を通じて、なぜ情報学を学ぼうと決めたのか、入学前にどのような準備をしたのかを整理できました。
この私の経験が、放送大学で情報学を学ぼうとする方々のキャリア形成の参考になれば幸いです。
